rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_ai.c
 * @brief   Minimal AI runtime bootstrap helpers.
 ******************************************************************************
 */
/* USER CODE END Header */

#include "app_ai.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stddef.h>
#include <float.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdio.h>

#include "debug_console.h"
#include "app_inference_calibration.h"
#include "app_baseline_runtime.h"
#include "app_inference_log_config.h"
#include "app_inference_log_utils.h"
#include "app_memory_budget.h"
#include "app_gauge_geometry.h"
#include "app_inner_celsius_mask.h"
#include "ina219_power.h"
#include "inference_metrics.h"
#include "app_center_detector.h"
#include "app_ai_config.h"
#define LL_ATON_PLATFORM LL_ATON_PLAT_STM32N6
#define LL_ATON_OSAL LL_ATON_OSAL_THREADX
#include "app_ai_types.h"
#include "app_ai_state.h"
#include "app_ai_logging.h"
#include "app_ai_xspi2.h"
#include "app_ai_preprocess.h"
#include "app_ai_inference.h"
#include "app_ai_stage_obb.h"
#include "app_ai_stage_tip_focus.h"
#include "tx_api.h"
#include "ll_aton_rt_user_api.h"
#include "ll_aton.h"
#include "ll_aton_runtime.h"
#include "ll_aton_reloc_network.h"
#if defined(__has_include)
#if __has_include("ll_aton_lib_sw_operators.c")
/* ST's relocatable exports still call a few pure software tensor operators.
 * Pull the pack source in here so the generated networks can link without
 * making the firmware project depend on extra build-system edits. */
#include "ll_aton_lib_sw_operators.c"
#else
#error "Missing ST AI software-operator source in the pack include path."
#endif
#else
#include "ll_aton_lib_sw_operators.c"
#endif
#include "app_filex.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "npu_cache.h"
#include "stm32n6xx_hal.h"
/*
 * The STM32N6 ATON runtime library expects this wait-mask state symbol when
 * it is built in debug mode. We provide it here so the rebuilt runtime object
 * can stay in release mode and still link cleanly with the rest of the app.
 */
#ifndef NDEBUG
uint32_t volatile __ll_current_wait_mask = 0U;
#endif

/*
 * Keep the very noisy tensor and patch dumps behind a toggle so the normal
 * AI status logs still use the shared debug console directly.
 */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */
bool app_ai_runtime_initialized = false;
bool app_ai_aton_runtime_initialized = false;
volatile float app_ai_last_inference_value = 0.0f;
volatile bool app_ai_last_inference_valid = false;
/* EMA-smoothed OBB centre to dampen single-frame x-center jitter. */
float app_ai_smoothed_obb_cx = -1.0f;
float app_ai_smoothed_obb_cy = -1.0f;
#define APP_AI_OBB_CENTER_EMA_ALPHA 0.20f
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
float app_ai_inference_burst_history
	[APP_AI_INFERENCE_BURST_HISTORY_SIZE] = {0.0f};
size_t app_ai_inference_burst_history_count = 0U;
size_t app_ai_inference_burst_history_next_index = 0U;
#endif
bool app_ai_npu_hw_initialized = false;
bool app_ai_xspi2_initialized = false;
bool app_ai_xspi2_mm_enabled = false;
const struct AppAI_ModelStageSpec *app_ai_loaded_xspi2_stage = NULL;
float app_ai_tip_focus_median_buffer[APP_AI_TIP_FOCUS_MEDIAN_BUFFER_SIZE] = {0.0f};
size_t app_ai_tip_focus_median_count = 0U;
size_t app_ai_tip_focus_median_index = 0U;
float app_ai_tip_focus_last_published = 0.0f;
bool app_ai_tip_focus_last_published_valid = false;
uint32_t app_ai_tip_focus_consecutive_invalid = 0U;
uint32_t app_ai_tip_focus_outlier_streak = 0U;
bool app_ai_forced_crop_active = false;
size_t app_ai_forced_crop_x_min = 0U;
size_t app_ai_forced_crop_y_min = 0U;
size_t app_ai_forced_crop_width = 0U;
size_t app_ai_forced_crop_height = 0U;
const char *app_ai_forced_crop_label = NULL;
bool app_ai_tip_focus_input_dump_done = false;
#if !APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE
/* Scalar model pool: 32-byte placeholder at 0x70200000 (EXTRAM).
 * The weight blob is pre-flashed to xSPI2 at this address; the NPU reads
 * weights directly from flash, not through this array. */
__attribute__((section(".xspi2_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_scalar_full_finetune_from_best_piecewise_calibrated_int8[32U] = {
	0U,
};
/* Heatmap CD model xSPI2 pool: same slot (0x70200000) as the scalar.
 * DS-CNN v4-S weights are pre-flashed here; the generated heatmap_cd.c
 * references _mem_pool_xSPI2_heatmap_cd for weight addressing. */
__attribute__((section(".xspi2_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_heatmap_cd[32U] = {
	0U,
};
/* Compact OBB 320 localizer pool lives in the dedicated OBB flash slot.
 * Keep the linker marker aligned with the flashed blob so the generated
 * reloc runtime can resolve the weight base correctly. */
__attribute__((section(".xspi2_rectifier_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_mobilenetv2_rectifier_hardcase_finetune[32U] = {
	0U,
};
/* Board bbox OBB pool.
 * Weight blob: obb_box_board_bbox_deploy_candidate_atonbuf.xSPI2.raw
 * Flashed to 0x71400000 (679,841 bytes, 664 KB).
 * No HyperRAM needed. */
__attribute__((section(".xspi2_obb_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_obb_box_board_bbox_deploy_candidate[32U] = { 0U, };


/* Source-crop-box model pool (mobilenetv2_source_crop_box_v1_stripped_int8). */

__attribute__((section(".xspi2_source_crop_box_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))

uint8_t _mem_pool_xSPI2_mobilenetv2_source_crop_box_v1_stripped_int8[32U] = {

