rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	0U,

};
#endif

/* Legacy OBB pool symbol kept for compatibility with the older face-localizer wrapper. */
__attribute__((section(".xspi2_obb_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_obb_face_v2_int8[32U] = { 0U, };
/* Live board-bbox OBB pool symbol used by the current qarepvgg wrapper. */
__attribute__((section(".xspi2_obb_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_obb_box_board_bbox_deploy_candidate[32U] = { 0U, };

/* Tip-focus v18 model pool.
 * Weight blob: tip_focus_v18_int8_atonbuf.xSPI2.raw
 * Flashed to 0x70400000 (834,465 bytes, 815 KB).
 * No HyperRAM needed — the no-HyperRAM mpool kept all activations on-chip.
 *
 * IMPORTANT: The actual weights data is NOT stored in this 32-byte array.
 * The data lives in xSPI2 flash at 0x70400000 and must be flashed via
 * flash_boot.bat before inference. */
__attribute__((section(".xspi2_tip_focus_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_tip_focus_v18_int8[32U] = { 0U, };
/* No xSPI1/HyperRAM pool needed — this model fits entirely on-chip. */
uint8_t app_ai_xspi2_program_buffer[APP_AI_XSPI2_PROGRAM_CHUNK_BYTES];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t app_ai_scalar_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL];
__attribute__((aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t app_ai_scalar_output_row_scratch[APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * 3U * sizeof(float)];
volatile size_t app_ai_scalar_preprocess_last_row = (size_t)SIZE_MAX;
/* Trace the scalar resize loop only every so often so we can tell whether it
 * is progressing without flooding UART in the hot path. */
#define APP_AI_SCALAR_PREPROCESS_ROW_TRACE_INTERVAL_ROWS 32U
/* Keep each preprocessing pass small enough that we can reshape the scalar
 * path without one huge monolithic row loop. */
#define APP_AI_SCALAR_PREPROCESS_ROWS_PER_CHUNK 8U
/* Start/tail signatures for the heatmap center-detector initializer blob.
 * Update these when a new model is exported by running:
 *   python3 -c "
 *     d=open('st_ai_output/packages/heatmap_cd_tiny/st_ai_output/heatmap_cd_atonbuf.AXISRAM2.raw','rb').read()
 *     print('start:', bytes(d[:16]).hex())
 *     print('tail: ', bytes(d[-16:]).hex())" */
/* Heatmap center-detector model (DS-CNN v4-S): 332,045 bytes flashed at 0x70200000.
 * Signatures unchanged from DS-CNN v4 — same first/last 16 bytes. */
const uint8_t app_ai_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x80U, 0x80U, 0x81U, 0x82U, 0x83U, 0x83U, 0x84U, 0x85U,
	0x86U, 0x87U, 0x87U, 0x88U, 0x89U, 0x8AU, 0x8BU, 0x8BU,
};
const uint8_t app_ai_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Rectified scalar v2 xSPI2 signatures used when the board boots with the
 * prod v0.8 scalar blob already flashed at 0x70200000. Size: 3,218,865 bytes. */
const uint8_t app_ai_rectifier_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x0FU, 0x11U, 0xF8U, 0x10U, 0xD0U, 0xD8U, 0x0EU, 0x28U,
	0x99U, 0xCEU, 0x98U, 0x7DU, 0xBCU, 0x42U, 0x5EU, 0xF2U,
};
const uint8_t app_ai_rectifier_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Board-bbox OBB xSPI2 signatures.
 * Flashed to 0x71400000. Size: 679,841 bytes (664 KB).
 * SHA256[:16]: 5BC95D0DB30862BE */
const uint8_t app_ai_obb_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x34U, 0x10U, 0x10U, 0x1CU, 0x11U, 0xDFU, 0xFEU, 0x2DU,
	0xD7U, 0xB0U, 0xCFU, 0x0CU, 0x04U, 0x0FU, 0xDBU, 0x0EU,
};
const uint8_t app_ai_obb_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};

/* Source-crop-box xSPI2 signatures for atonbuf.source_crop_box.xSPI2.raw. */
const uint8_t app_ai_source_crop_box_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xF2U, 0x17U, 0x29U, 0xE2U, 0xDCU, 0xEBU, 0xECU, 0x04U,
	0x09U, 0x01U, 0x35U, 0xEBU, 0x14U, 0xDEU, 0x0FU, 0x02U,
};
const uint8_t app_ai_source_crop_box_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Tip-focus v18 xSPI2 signatures.
 * Flashed to 0x70400000. Size: 834,465 bytes (815 KB).
 * SHA256[:16]: 3588104D20D96224 */
const uint8_t app_ai_tip_focus_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0x48U, 0x0AU, 0x13U, 0xC1U, 0x26U, 0xF5U, 0xFCU, 0xE5U,
	0xE9U, 0x37U, 0x1DU, 0xFAU, 0xEAU, 0xC2U, 0xEDU, 0x04U,
};
const uint8_t app_ai_tip_focus_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x80U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
};
/* The shared xSPI2 helper paths should verify against the live UNet blob. */
#define app_ai_xspi2_signature_start app_ai_tip_focus_xspi2_signature_start
#define app_ai_xspi2_signature_tail app_ai_tip_focus_xspi2_signature_tail
/* Per-stage programmed sizes. Set during provisioning and used by the verify
 * functions for the tail probe offset. Keeping them separate prevents the
 * scalar tail check from using the rectifier's file size (or vice-versa) when
 * stages alternate. */
ULONG app_ai_scalar_programmed_size = 0UL;
ULONG app_ai_rectifier_programmed_size = 0UL;
ULONG app_ai_obb_programmed_size = 0UL;
ULONG app_ai_source_crop_box_programmed_size = 0UL;

/* Per-stage signature caches populated from the SD file during provisioning.
 * Using SD-sourced bytes means verify never goes stale when the model blob is
 * replaced, regardless of what the hardcoded fallback constants say. */
uint8_t app_ai_scalar_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
uint8_t app_ai_scalar_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
bool app_ai_scalar_sig_valid = false;
uint8_t app_ai_rectifier_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
uint8_t app_ai_rectifier_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
bool app_ai_rectifier_sig_valid = false;
uint8_t app_ai_obb_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
uint8_t app_ai_obb_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
bool app_ai_obb_sig_valid = false;
uint8_t app_ai_source_crop_box_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
uint8_t app_ai_source_crop_box_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
bool app_ai_source_crop_box_sig_valid = false;
/* Legacy alias kept for the shared xSPI2 logging helpers; the live tip-focus
 * build still expects this size tracker to exist. */
ULONG app_ai_xspi2_programmed_size = 0UL;
ULONG app_ai_tip_focus_programmed_size = 0UL;
uint8_t app_ai_tip_focus_sig_start[APP_AI_XSPI2_PROBE_BYTES] = {0U};
uint8_t app_ai_tip_focus_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = {0U};
bool app_ai_tip_focus_sig_valid = false;

/* NN_Instance variables are now defined in the generated model files and
 * declared extern in app_ai_state.h.  Keep them out of this TU so the
 * linker resolves a single definition per symbol. */

