rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* OBB reloc helper exported by the wrapper thunk so the stage can install
 * its runtime base before the ATON resize helper runs. */
extern bool AppAI_Obb_InstallRelocContext(NN_Instance_TypeDef *instance, uintptr_t xspi2_base_addr);

const AppAI_ModelStageSpec app_ai_obb_stage = {
	.stage_label = "obb_box_board_bbox_deploy_candidate",
	.model_image_path = APP_AI_OBB_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_obb_box_board_bbox_deploy_candidate,
	.network_init_fn = LL_ATON_EC_Network_Init_obb_box_board_bbox_deploy_candidate,
	.inference_init_fn = LL_ATON_EC_Inference_Init_obb_box_board_bbox_deploy_candidate,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_OBB_CHIP_OFFSET,
	.xspi2_base_addr = APP_AI_XSPI2_OBB_BASE_ADDR,
};

bool AppAI_ShouldLogStageDiagnostics(
	const AppAI_ModelStageSpec *stage)
{
	(void)stage;
	return true;
}

/* Forward declarations for the local helpers that the board-bbox decoder uses
 * before their definitions later in this translation unit. */
bool AppAI_IsFiniteFloat(float value);
float AppAI_ClampNormalizedFloat(float value);
float AppAI_ObbDequantize(int8_t q_value);
bool AppAI_BuildObbDecodeCandidate(
	float x_min, float y_min, float x_max, float y_max,
	AppAI_ObbDecodeCandidate *candidate);
void AppAI_LogObbDecodeDiagnostics(
	float score,
	float raw0,
	float raw1,
	float raw2,
	float raw3,
	const AppAI_ObbDecodeCandidate *corners_candidate,
	const AppAI_ObbDecodeCandidate *center_size_candidate,
	const char *selected_label);
bool AppAI_DumpTipFocusInputTensorOnce(
	const float *input_ptr,
	size_t output_width,
	size_t output_height,
	const char *crop_label,
	const AppAI_SourceCrop *crop_ptr,
	bool obb_crop_valid,
	const AppAI_ObbBox *obb_box);

/* Board-bbox bridge for the deployed OBB candidate.
 * output_buffers_info array: [0]=confidence scalar, [1]=bbox vector, [2]=NULL terminator.
 * The bbox vector has to survive both the historical corner-style export and
 * the newer center/size-style export, so we decode both layouts and keep the
 * first plausible crop we can prove is finite and non-degenerate. */
bool AppAI_DecodeQarepvggObb(
    const LL_Buffer_InfoTypeDef *output_info,
    AppAI_SourceCrop            *obb_crop,
    AppAI_ObbBox                *obb_box)
{
	if ((output_info == NULL) || (obb_crop == NULL) || (obb_box == NULL))
	{
		return false;
	}

	const LL_Buffer_InfoTypeDef *score_info = &output_info[0U];
	const LL_Buffer_InfoTypeDef *box_info = &output_info[1U];
	const int8_t *score_raw = NULL;
	const int8_t *box_raw = NULL;
	float score = 0.0f;
	float raw0 = 0.0f;
	float raw1 = 0.0f;
	float raw2 = 0.0f;
	float raw3 = 0.0f;
	float center_x = 0.0f;
	float center_y = 0.0f;
	float box_w = 0.0f;
	float box_h = 0.0f;
	float center_box_x_min = 0.0f;
	float center_box_y_min = 0.0f;
	float center_box_x_max = 0.0f;
	float center_box_y_max = 0.0f;
	AppAI_ObbDecodeCandidate corners_candidate = {0};
	AppAI_ObbDecodeCandidate center_size_candidate = {0};
	const char *selected_label = "none";
	bool corners_valid = false;
	bool center_size_valid = false;

	/* Verify both outputs are present and large enough for the scalar + bbox head. */
	if ((score_info->name == NULL) || (box_info->name == NULL))
	{
		return false;
	}
	if ((LL_Buffer_len(score_info) < 1U) || (LL_Buffer_len(box_info) < 4U))
	{
		return false;
	}

	score_raw = (const int8_t *)LL_Buffer_addr_start(score_info);
	box_raw = (const int8_t *)LL_Buffer_addr_start(box_info);
	if ((score_raw == NULL) || (box_raw == NULL))
	{
		return false;
	}

	score = AppAI_ClampNormalizedFloat(AppAI_ObbDequantize(score_raw[0]));
	raw0 = AppAI_ClampNormalizedFloat(AppAI_ObbDequantize(box_raw[0]));
	raw1 = AppAI_ClampNormalizedFloat(AppAI_ObbDequantize(box_raw[1]));
	raw2 = AppAI_ClampNormalizedFloat(AppAI_ObbDequantize(box_raw[2]));
	raw3 = AppAI_ClampNormalizedFloat(AppAI_ObbDequantize(box_raw[3]));

	if (!AppAI_IsFiniteFloat(score) || !AppAI_IsFiniteFloat(raw0) ||
		!AppAI_IsFiniteFloat(raw1) || !AppAI_IsFiniteFloat(raw2) ||
		!AppAI_IsFiniteFloat(raw3))
	{
		return false;
	}

	if (score < 0.05f)
	{
		return false;
	}

	/* First try the label-source contract: normalized x_min, y_min, x_max, y_max. */
	corners_valid = AppAI_BuildObbDecodeCandidate(
		raw0, raw1, raw2, raw3, &corners_candidate);

	/* If the export was center/size, recover the actual corners from the same
	 * 4-vector rather than rejecting the model output outright. */
	center_box_x_min = raw0 - (0.5f * raw2);
	center_box_y_min = raw1 - (0.5f * raw3);
	center_box_x_max = raw0 + (0.5f * raw2);
	center_box_y_max = raw1 + (0.5f * raw3);
	if (center_box_x_max < center_box_x_min)
	{
		const float tmp = center_box_x_min;
		center_box_x_min = center_box_x_max;
		center_box_x_max = tmp;
	}
	if (center_box_y_max < center_box_y_min)
	{
		const float tmp = center_box_y_min;
		center_box_y_min = center_box_y_max;
		center_box_y_max = tmp;
	}

	center_size_valid = AppAI_BuildObbDecodeCandidate(
		center_box_x_min, center_box_y_min,
		center_box_x_max, center_box_y_max,
		&center_size_candidate);

	if (!corners_valid && !center_size_valid)
	{
		AppAI_LogObbDecodeDiagnostics(
			score, raw0, raw1, raw2, raw3,
			&corners_candidate, &center_size_candidate, selected_label);
		return false;
	}

	if (corners_valid)
	{
		/* Keep the original corner-style export as the preferred path when it
		 * already produces a sane box. */
		selected_label = "corners";
		center_x = corners_candidate.center_x;
		center_y = corners_candidate.center_y;
		box_w = corners_candidate.box_w;
		box_h = corners_candidate.box_h;
		*obb_crop = corners_candidate.crop;
	}
	else
	{
		selected_label = "center-size";
		center_x = center_size_candidate.center_x;
		center_y = center_size_candidate.center_y;
		box_w = center_size_candidate.box_w;
		box_h = center_size_candidate.box_h;
		*obb_crop = center_size_candidate.crop;
	}
	AppAI_LogObbDecodeDiagnostics(
		score, raw0, raw1, raw2, raw3,
		&corners_candidate, &center_size_candidate, selected_label);

	obb_box->center_x = center_x;
	obb_box->center_y = center_y;
	obb_box->box_w = box_w;
	obb_box->box_h = box_h;
	obb_box->angle_rad = 0.0f;
	obb_box->confidence = score;
	obb_box->gauge_center_x = center_x;
	obb_box->gauge_center_y = center_y;
	return true;
}

/* USER CODE END PV */

