rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
bool __attribute__((noinline)) AppAI_PreprocessYuv422FrameToFloatInput(
	const uint8_t *frame_bytes, size_t frame_size, float *input_ptr,
	size_t input_float_count, size_t input_len_bytes,
	size_t output_width, size_t output_height)
{
	const size_t source_width = (size_t)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t required_float_count = output_width * output_height * 3U;
	const size_t required_bytes = required_float_count * sizeof(float);
	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";

	if ((frame_bytes == NULL) || (input_ptr == NULL))
	{
		return false;
	}
	if ((output_width == 0U) || (output_height == 0U))
	{
		return false;
	}
	if ((frame_size < (size_t)APP_AI_CAPTURE_FRAME_BYTES) ||
		(input_float_count < required_float_count) ||
		(input_len_bytes < required_bytes))
	{
		return false;
	}

	if (app_ai_forced_crop_active)
	{
		crop_found = true;
		crop_label = (app_ai_forced_crop_label != NULL)
						 ? app_ai_forced_crop_label
						 : "forced";
		crop_x_min = app_ai_forced_crop_x_min;
		crop_y_min = app_ai_forced_crop_y_min;
		crop_width = app_ai_forced_crop_width;
		crop_height = app_ai_forced_crop_height;
	}
	else
	{
#if APP_AI_USE_ADAPTIVE_GAUGE_CROP
		crop_found = AppAI_EstimateGaugeCropBoxFromYuv422(
			frame_bytes, frame_size, source_width, source_height,
			&crop_x_min, &crop_y_min, &crop_width, &crop_height);
#endif
		if (crop_found)
		{
			crop_label = "adaptive";
		}
	}

	if (!crop_found)
	{
		crop_x_min = (size_t)((float)source_width * APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_y_min = (size_t)((float)source_height * APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_width = (size_t)((float)source_width *
			(APP_AI_TRAINING_CROP_X_MAX_RATIO - APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_height = (size_t)((float)source_height *
			(APP_AI_TRAINING_CROP_Y_MAX_RATIO - APP_AI_TRAINING_CROP_Y_MIN_RATIO));
	}

	if (crop_width == 0U)
	{
		crop_width = 1U;
	}
	if (crop_height == 0U)
	{
		crop_height = 1U;
	}
	if (crop_x_min >= source_width)
	{
		crop_x_min = source_width - 1U;
		crop_width = 1U;
	}
	if (crop_y_min >= source_height)
	{
		crop_y_min = source_height - 1U;
		crop_height = 1U;
	}
	if ((crop_x_min + crop_width) > source_width)
	{
		crop_width = source_width - crop_x_min;
	}
	if ((crop_y_min + crop_height) > source_height)
	{
		crop_height = source_height - crop_y_min;
	}

	DebugConsole_Printf("[AI] Crop %s: x=%lu y=%lu w=%lu h=%lu\r\n",
					   crop_label,
					   (unsigned long)crop_x_min,
					   (unsigned long)crop_y_min,
					   (unsigned long)crop_width,
					   (unsigned long)crop_height);
	(void)DebugConsole_WriteString("[AI] Preprocess diagnostics OK.\r\n");
	(void)DebugConsole_WriteString("[AI] Preprocess zero-fill skipped.\r\n");
	(void)DebugConsole_WriteString("[AI] Preprocess resize start.\r\n");

	{
		const float resize_scale =
			fminf((float)output_width / (float)crop_width,
				  (float)output_height / (float)crop_height);
		size_t resized_width = (size_t)(((float)crop_width * resize_scale) + 0.5f);
		size_t resized_height = (size_t)(((float)crop_height * resize_scale) + 0.5f);
		float *dst = input_ptr;

		if (resized_width == 0U)
		{
			resized_width = 1U;
		}
		if (resized_height == 0U)
		{
			resized_height = 1U;
		}
		if (resized_width > output_width)
		{
			resized_width = output_width;
		}
		if (resized_height > output_height)
		{
			resized_height = output_height;
		}

		const size_t resize_pad_x = (output_width - resized_width) / 2U;
		const size_t resize_pad_y = (output_height - resized_height) / 2U;

		(void)DebugConsole_WriteString("[AI] Preprocess row loop enter.\r\n");

		for (size_t out_y = 0U; out_y < output_height; ++out_y)
		{
			for (size_t out_x = 0U; out_x < output_width; ++out_x)
			{
				float out_r = 0.0f;
				float out_g = 0.0f;
				float out_b = 0.0f;

				if ((out_x >= resize_pad_x) &&
					(out_x < (resize_pad_x + resized_width)) &&
					(out_y >= resize_pad_y) &&
					(out_y < (resize_pad_y + resized_height)))
				{
					const float resized_x = (float)(out_x - resize_pad_x);
					const float resized_y = (float)(out_y - resize_pad_y);
					const float crop_x = ((resized_x + 0.5f) / resize_scale) - 0.5f;
					const float crop_y = ((resized_y + 0.5f) / resize_scale) - 0.5f;
					const float src_x = (float)crop_x_min + crop_x;
					const float src_y = (float)crop_y_min + crop_y;

					AppAI_ReadRgbFromYuv422Bilinear(
						frame_bytes, frame_size, source_width, source_height,
						src_x, src_y, &out_r, &out_g, &out_b);
				}

				*dst++ = AppAI_ClampNormalizedFloat(out_r);
				*dst++ = AppAI_ClampNormalizedFloat(out_g);
				*dst++ = AppAI_ClampNormalizedFloat(out_b);
			}
		}
	}

	(void)DebugConsole_WriteString("[AI] Preprocess resize OK.\r\n");
	/* Log the input buffer address, length, and live r9 right after the resize
	 * so we can tell whether the tip-focus model is being handed a valid
	 * tensor pointer and a sane reloc base. A null input_ptr or a zero r9
	 * here is the most common cause of a post-preprocess HardFault. */
	{
		uintptr_t post_resize_r9 = 0U;
		__asm volatile("mov %0, r9" : "=r"(post_resize_r9));
		DebugConsole_Printf(
			"[AI] Preprocess post: input_ptr=%p input_len=%lu floats=%lu r9=%p\r\n",
			(const void *)input_ptr,
			(unsigned long)input_len_bytes,
			(unsigned long)input_float_count,
			(const void *)post_resize_r9);
	}
	return true;
}

bool AppAI_BuildObbDecodeCandidate(
	float x_min, float y_min, float x_max, float y_max,
	AppAI_ObbDecodeCandidate *candidate)
{
	float center_x = 0.0f;
	float center_y = 0.0f;
	float box_w = 0.0f;
	float box_h = 0.0f;
	float cx_px = 0.0f;
	float cy_px = 0.0f;
	float bw_px = 0.0f;
	float bh_px = 0.0f;
	float crop_w = 0.0f;
	float crop_h = 0.0f;
	float crop_x_min = 0.0f;
	float crop_y_min = 0.0f;

	if (candidate == NULL)
	{
		return false;
	}

	(void)memset(candidate, 0, sizeof(*candidate));

