rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	if (x_max < x_min)
	{
		const float tmp = x_min;
		x_min = x_max;
		x_max = tmp;
	}
	if (y_max < y_min)
	{
		const float tmp = y_min;
		y_min = y_max;
		y_max = tmp;
	}

	center_x = 0.5f * (x_min + x_max);
	center_y = 0.5f * (y_min + y_max);
	box_w = x_max - x_min;
	box_h = y_max - y_min;

	if (!AppAI_IsFiniteFloat(x_min) || !AppAI_IsFiniteFloat(y_min) ||
		!AppAI_IsFiniteFloat(x_max) || !AppAI_IsFiniteFloat(y_max) ||
		!AppAI_IsFiniteFloat(center_x) || !AppAI_IsFiniteFloat(center_y) ||
		!AppAI_IsFiniteFloat(box_w) || !AppAI_IsFiniteFloat(box_h) ||
		(box_w <= 0.0f) || (box_h <= 0.0f))
	{
		return false;
	}

	if (box_w < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_w = APP_AI_OBB_MIN_BOX_RATIO;
	}
	else if (box_w > 1.0f)
	{
		box_w = 1.0f;
	}
	if (box_h < APP_AI_OBB_MIN_BOX_RATIO)
	{
		box_h = APP_AI_OBB_MIN_BOX_RATIO;
	}
	else if (box_h > 1.0f)
	{
		box_h = 1.0f;
	}

	cx_px = center_x * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	cy_px = center_y * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	bw_px = box_w * (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	bh_px = box_h * (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	crop_w = bw_px * APP_AI_OBB_CROP_SCALE;
	crop_h = bh_px * APP_AI_OBB_CROP_SCALE;
	crop_x_min = cx_px - crop_w * 0.5f;
	crop_y_min = cy_px - crop_h * 0.5f;

	if (crop_x_min < 0.0f)
	{
		crop_x_min = 0.0f;
	}
	if (crop_y_min < 0.0f)
	{
		crop_y_min = 0.0f;
	}
	if ((crop_x_min + crop_w) > (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
	{
		crop_w = (float)APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - crop_x_min;
	}
	if ((crop_y_min + crop_h) > (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS)
	{
		crop_h = (float)APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - crop_y_min;
	}
	if ((crop_w < APP_AI_OBB_MIN_CROP_SIZE_PIXELS) ||
		(crop_h < APP_AI_OBB_MIN_CROP_SIZE_PIXELS))
	{
		return false;
	}

	candidate->valid = true;
	candidate->x_min = x_min;
	candidate->y_min = y_min;
	candidate->x_max = x_max;
	candidate->y_max = y_max;
	candidate->center_x = center_x;
	candidate->center_y = center_y;
	candidate->box_w = box_w;
	candidate->box_h = box_h;
	candidate->crop.x_min = (size_t)(crop_x_min + 0.5f);
	candidate->crop.y_min = (size_t)(crop_y_min + 0.5f);
	candidate->crop.width = (size_t)(crop_w + 0.5f);
	candidate->crop.height = (size_t)(crop_h + 0.5f);
	return true;
}

void AppAI_LogObbDecodeDiagnostics(
	float score,
	float raw0,
	float raw1,
	float raw2,
	float raw3,
	const AppAI_ObbDecodeCandidate *corners_candidate,
	const AppAI_ObbDecodeCandidate *center_size_candidate,
	const char *selected_label)
{
#if APP_AI_ENABLE_OBB_DECODE_DIAGNOSTICS
	const long score_100 = lroundf(score * 100.0f);
	const long raw0_100 = lroundf(raw0 * 100.0f);
	const long raw1_100 = lroundf(raw1 * 100.0f);
	const long raw2_100 = lroundf(raw2 * 100.0f);
	const long raw3_100 = lroundf(raw3 * 100.0f);

	DebugConsole_Printf(
		"[AI][OBB] score=%ld.%02ld raw=[%ld.%02ld %ld.%02ld %ld.%02ld %ld.%02ld]\r\n",
		labs(score_100) / 100L, labs(score_100) % 100L,
		labs(raw0_100) / 100L, labs(raw0_100) % 100L,
		labs(raw1_100) / 100L, labs(raw1_100) % 100L,
		labs(raw2_100) / 100L, labs(raw2_100) % 100L,
		labs(raw3_100) / 100L, labs(raw3_100) % 100L);

	if ((corners_candidate != NULL) && corners_candidate->valid)
	{
		const long cx_100 = lroundf(corners_candidate->center_x * 100.0f);
		const long cy_100 = lroundf(corners_candidate->center_y * 100.0f);
		const long bw_100 = lroundf(corners_candidate->box_w * 100.0f);
		const long bh_100 = lroundf(corners_candidate->box_h * 100.0f);
		DebugConsole_Printf(
			"[AI][OBB] corners center=(%ld.%02ld,%ld.%02ld) size=(%ld.%02ld,%ld.%02ld) crop=x%lu y%lu w%lu h%lu\r\n",
			labs(cx_100) / 100L, labs(cx_100) % 100L,
			labs(cy_100) / 100L, labs(cy_100) % 100L,
			labs(bw_100) / 100L, labs(bw_100) % 100L,
			labs(bh_100) / 100L, labs(bh_100) % 100L,
			(unsigned long)corners_candidate->crop.x_min,
			(unsigned long)corners_candidate->crop.y_min,
			(unsigned long)corners_candidate->crop.width,
			(unsigned long)corners_candidate->crop.height);
	}
	else
	{
		DebugConsole_WriteString("[AI][OBB] corners invalid\r\n");
	}

	if ((center_size_candidate != NULL) && center_size_candidate->valid)
	{
		const long cx_100 = lroundf(center_size_candidate->center_x * 100.0f);
		const long cy_100 = lroundf(center_size_candidate->center_y * 100.0f);
		const long bw_100 = lroundf(center_size_candidate->box_w * 100.0f);
		const long bh_100 = lroundf(center_size_candidate->box_h * 100.0f);
		DebugConsole_Printf(
			"[AI][OBB] center-size center=(%ld.%02ld,%ld.%02ld) size=(%ld.%02ld,%ld.%02ld) crop=x%lu y%lu w%lu h%lu\r\n",
			labs(cx_100) / 100L, labs(cx_100) % 100L,
			labs(cy_100) / 100L, labs(cy_100) % 100L,
			labs(bw_100) / 100L, labs(bw_100) % 100L,
			labs(bh_100) / 100L, labs(bh_100) % 100L,
			(unsigned long)center_size_candidate->crop.x_min,
			(unsigned long)center_size_candidate->crop.y_min,
			(unsigned long)center_size_candidate->crop.width,
			(unsigned long)center_size_candidate->crop.height);
	}
	else
	{
		DebugConsole_WriteString("[AI][OBB] center-size invalid\r\n");
	}

	DebugConsole_Printf("[AI][OBB] selected=%s\r\n",
		(selected_label != NULL) ? selected_label : "none");
#else
	(void)score;
	(void)raw0;
	(void)raw1;
	(void)raw2;
	(void)raw3;
	(void)corners_candidate;
	(void)center_size_candidate;
	(void)selected_label;
#endif
}

bool AppAI_DumpTipFocusInputTensorOnce(
	const float *input_ptr,
	size_t output_width,
	size_t output_height,
	const char *crop_label,
	const AppAI_SourceCrop *crop_ptr,
	bool obb_crop_valid,
	const AppAI_ObbBox *obb_box)
{
#if APP_AI_ENABLE_TIP_FOCUS_INPUT_DUMP
	FX_MEDIA *media = NULL;
	FX_FILE ppm_file = {0};
	FX_FILE meta_file = {0};
	UINT fx_status = FX_SUCCESS;
	UINT open_status = FX_SUCCESS;
	char ppm_path[48] = {0};
	char meta_path[48] = {0};
	char ppm_header[32] = {0};
	char meta_text[256] = {0};
	float min_value = 0.0f;
	float max_value = 0.0f;
	bool unit_scale = true;
	uint8_t row_bytes[3U * APP_AI_TIP_FOCUS_MODEL_INPUT_WIDTH_PIXELS] = {0U};

	if (app_ai_tip_focus_input_dump_done)
	{
		return true;
	}
	if ((input_ptr == NULL) || (output_width == 0U) || (output_height == 0U) ||
		(output_width > APP_AI_TIP_FOCUS_MODEL_INPUT_WIDTH_PIXELS))
	{
		return false;
	}
	if (!AppFileX_IsMediaReady())
	{
		DebugConsole_WriteString(
			"[AI][TIP_FOCUS] SD not ready; skipping one-shot input dump.\r\n");
		return false;
	}

	min_value = input_ptr[0];
	max_value = input_ptr[0];
	for (size_t i = 1U; i < (output_width * output_height * 3U); ++i)
	{
		const float value = input_ptr[i];
		if (value < min_value)
		{
			min_value = value;
		}
		if (value > max_value)
		{
			max_value = value;
		}
	}
	unit_scale = (min_value >= -0.25f) && (max_value <= 1.25f);

