rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	media = AppFileX_GetMediaHandle();
	if (media == NULL)
	{
		return false;
	}

	fx_status = AppFileX_AcquireMediaLock();
	if (fx_status != TX_SUCCESS)
	{
		DebugConsole_Printf(
			"[AI][TIP_FOCUS] Failed to acquire FileX lock for input dump, status=%lu.\r\n",
			(unsigned long)fx_status);
		return false;
	}

	(void)fx_directory_create(media, INFERENCE_LOG_DIRECTORY_NAME);
	(void)DebugConsole_Snprintf(ppm_path, sizeof(ppm_path),
		"%s/tip_focus_input.ppm", INFERENCE_LOG_DIRECTORY_NAME);
	(void)DebugConsole_Snprintf(meta_path, sizeof(meta_path),
		"%s/tip_focus_input.txt", INFERENCE_LOG_DIRECTORY_NAME);
	(void)fx_file_delete(media, ppm_path);
	(void)fx_file_delete(media, meta_path);
	(void)fx_file_create(media, ppm_path);
	(void)fx_file_create(media, meta_path);

	open_status = fx_file_open(media, &ppm_file, ppm_path, FX_OPEN_FOR_WRITE);
	if (open_status != FX_SUCCESS)
	{
		AppFileX_ReleaseMediaLock();
		DebugConsole_Printf(
			"[AI][TIP_FOCUS] Failed to open %s, status=%lu.\r\n",
			ppm_path, (unsigned long)open_status);
		return false;
	}

	(void)DebugConsole_Snprintf(ppm_header, sizeof(ppm_header),
		"P6\n%lu %lu\n255\n",
		(unsigned long)output_width,
		(unsigned long)output_height);
	(void)fx_file_write(&ppm_file, (VOID *)ppm_header,
		(ULONG)strlen(ppm_header));

	for (size_t y = 0U; y < output_height; ++y)
	{
		for (size_t x = 0U; x < output_width; ++x)
		{
			const size_t pixel_index = ((y * output_width) + x) * 3U;
			for (size_t channel = 0U; channel < 3U; ++channel)
			{
				float value = input_ptr[pixel_index + channel];
				if (unit_scale)
				{
					value *= 255.0f;
				}
				if (value < 0.0f)
				{
					value = 0.0f;
				}
				else if (value > 255.0f)
				{
					value = 255.0f;
				}
				row_bytes[(x * 3U) + channel] = (uint8_t)(value + 0.5f);
			}
		}
		(void)fx_file_write(&ppm_file, row_bytes, (ULONG)(output_width * 3U));
	}
	(void)fx_file_close(&ppm_file);

	open_status = fx_file_open(media, &meta_file, meta_path, FX_OPEN_FOR_WRITE);
	if (open_status == FX_SUCCESS)
	{
		const long conf_100 =
			(obb_box != NULL) ? lroundf(obb_box->confidence * 100.0f) : 0L;
		(void)DebugConsole_Snprintf(
			meta_text, sizeof(meta_text),
			"crop_label=%s\r\n"
			"obb_crop_valid=%lu\r\n"
			"crop_x=%lu\r\n"
			"crop_y=%lu\r\n"
			"crop_w=%lu\r\n"
			"crop_h=%lu\r\n"
			"obb_confidence=%ld.%02ld\r\n"
			"input_min_milli=%ld\r\n"
			"input_max_milli=%ld\r\n"
			"unit_scale=%lu\r\n",
			(crop_label != NULL) ? crop_label : "unknown",
			(unsigned long)(obb_crop_valid ? 1U : 0U),
			(unsigned long)((crop_ptr != NULL) ? crop_ptr->x_min : 0U),
			(unsigned long)((crop_ptr != NULL) ? crop_ptr->y_min : 0U),
			(unsigned long)((crop_ptr != NULL) ? crop_ptr->width : 0U),
			(unsigned long)((crop_ptr != NULL) ? crop_ptr->height : 0U),
			labs(conf_100) / 100L,
			labs(conf_100) % 100L,
			(long)lroundf(min_value * 1000.0f),
			(long)lroundf(max_value * 1000.0f),
			(unsigned long)(unit_scale ? 1U : 0U));
		(void)fx_file_write(&meta_file, (VOID *)meta_text,
			(ULONG)strlen(meta_text));
		(void)fx_file_close(&meta_file);
	}

	(void)fx_media_flush(media);
	AppFileX_ReleaseMediaLock();
	app_ai_tip_focus_input_dump_done = true;
	DebugConsole_Printf(
		"[AI][TIP_FOCUS] dumped exact input to %s and %s (crop=%s x=%lu y=%lu w=%lu h=%lu min_milli=%ld max_milli=%ld unit=%lu)\r\n",
		ppm_path,
		meta_path,
		(crop_label != NULL) ? crop_label : "unknown",
		(unsigned long)((crop_ptr != NULL) ? crop_ptr->x_min : 0U),
		(unsigned long)((crop_ptr != NULL) ? crop_ptr->y_min : 0U),
		(unsigned long)((crop_ptr != NULL) ? crop_ptr->width : 0U),
		(unsigned long)((crop_ptr != NULL) ? crop_ptr->height : 0U),
		(long)lroundf(min_value * 1000.0f),
		(long)lroundf(max_value * 1000.0f),
		(unsigned long)(unit_scale ? 1U : 0U));
	return true;
#else
	(void)input_ptr;
	(void)output_width;
	(void)output_height;
	(void)crop_label;
	(void)crop_ptr;
	(void)obb_crop_valid;
	(void)obb_box;
	return false;
#endif
}

/**
 * @brief Return the relocatable runtime base expected in r9 for a network.
 */
uintptr_t AppAI_GetRelocRuntimeR9(const NN_Instance_TypeDef *nn_instance)
{
	if (nn_instance == &NN_Instance_obb_box_board_bbox_deploy_candidate)
	{
		/* The OBB package is flashed as a fixed XIP image, but the generated
		 * epoch blocks still expect a stable runtime base in r9 for their
		 * internal SW helpers. When the reloc handle is intentionally cleared
		 * during init, fall back to the model's fixed runtime window instead of
		 * inheriting whatever junk r9 happened to contain on entry. */
		return (uintptr_t)APP_AI_OBB_RELOC_RAM_BASE_ADDR;
	}

	if ((nn_instance != NULL) && (nn_instance->exec_state.inst_reloc != 0U))
	{
		const struct ai_reloc_rt_ctx *rt_ctx =
			(const struct ai_reloc_rt_ctx *)(uintptr_t)nn_instance->exec_state.inst_reloc;
		if ((rt_ctx != NULL) && (rt_ctx->ram_addr != 0U))
		{
			return (uintptr_t)rt_ctx->ram_addr;
		}
	}

	return 0U;
}
